# Brewfile - Homebrew packages for a fresh Mac setup
# Install with: brew bundle --file=Brewfile
#
# To dump your current packages: brew bundle dump --file=Brewfile.local

################################################################################
# CLI essentials
################################################################################
brew "git"
brew "vim"
brew "tmux"
brew "fzf"
brew "the_silver_searcher"  # ag
brew "ripgrep"              # rg
brew "bat"                  # better cat
brew "jq"                   # JSON processor
brew "yq"                   # YAML processor
brew "tree"
brew "wget"
brew "curl"
brew "htop"
brew "icdiff"               # improved diff
brew "direnv"               # per-directory env vars
brew "pre-commit"

################################################################################
# Version managers
################################################################################
brew "asdf"
brew "pyenv"
brew "rbenv"
brew "nvm"

################################################################################
# Cloud & Infrastructure
################################################################################
brew "awscli"
brew "kubectl"
brew "helm"
brew "kustomize"
brew "kubectx"              # kubens + kubectx

################################################################################
# GitHub
################################################################################
brew "gh"

################################################################################
# Languages / Runtimes
################################################################################
brew "go"

################################################################################
# Oh-My-Zsh + Plugins (installed via install.sh, listed here for reference)
################################################################################
# oh-my-zsh           -> sh -c "$(curl -fsSL https://raw.githubusercontent.com/ohmyzsh/ohmyzsh/master/tools/install.sh)"
# powerlevel10k       -> git clone into $ZSH_CUSTOM/themes/
# zsh-autosuggestions -> git clone into $ZSH_CUSTOM/plugins/
# zsh-syntax-highlighting -> git clone into $ZSH_CUSTOM/plugins/

